
const config = {
    mapCode: {
        '杭州市': 'A3301',
        '宁波市': 'A3302',
        '温州市': 'A3303',
        '嘉兴市': 'A3304',
        '湖州市': 'A3305',
        '绍兴市': 'A3306',
        '金华市': 'A3307',
        '衢州市': 'A3308',
        '丽水市': 'A3309',
        '台州市': 'A3310',
        '舟山市': 'A3311'
    },
    mapName: {

    },
    colorName: [
        '#fa150d',
        '#fa7b78', // 红
        '#ff66ec',
        '#ffa900', // 橙
        '#e9e025', // 黄
        '#e2e07e',
        '#94ef30', // 绿
        '#6bdaff', // 蓝
        '#419eff',
        '#6668ff', // 紫
        '#ffffff' // 白
    ],
    arrName: [
        '杭州市',
        '宁波市',
        '温州市',
        '嘉兴市',
        '湖州市',
        '绍兴市',
        '金华市',
        '衢州市',
        '丽水市',
        '台州市',
        '舟山市'
    ],
    arrAbbrName:[
        '杭州',
        '宁波',
        '温州',
        '嘉兴',
        '湖州',
        '绍兴',
        '金华',
        '衢州',
        '丽水',
        '台州',
        '舟山',
    ],
    arrCode: [
        'A3301',
        'A3302',
        'A3303',
        'A3304',
        'A3305',
        'A3306',
        'A3307',
        'A3308',
        'A3309',
        'A3310',
        'A3311'
    ]
};
for (let [key, value] of Object.entries(config.mapCode)) { // 翻转浙江个地市级编号和名称
    config.mapName[value] = key;
}
export default config;